<a href="https://colab.research.google.com/github/israelruiz2005/projetos_pandas/blob/main/Introdu%C3%A7%C3%A3o_ao_pandas_parte_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Olhando melhor para os DataFrames

![300px-Pandas_logo.svg.png]()


Em programação de computadores, pandas é uma biblioteca de software criada para a linguagem Python, utilizada para manipulação e análise de dados. Em particular, oferece estruturas e operações para manipular tabelas numéricas e séries temporais. *fonte:[wikipedia](https://pt.wikipedia.org/wiki/Pandas_(software)#:~:text=Em%20programa%C3%A7%C3%A3o%20de%20computadores%2C%20pandas,tabelas%20num%C3%A9ricas%20e%20s%C3%A9ries%20temporais.)*

Isso e um pouco mais você já viu no artigo anterior, agora vamos olhar mais de perto o DataFrames.

# Recordar é viver! 
(isso é meio brega mas funciona)
## Documentação

A biblioteca possui uma vasta documentação que pode ser consultada no site oficial https://pandas.pydata.org/docs/.

### Instalação


Podemos instalar a biblioteca através do anaconda com o comando

`conda install pandas`

ou através do pip

`pip install pandas`


No google.colab já vem pronta para uso.

In [1]:
# abaixo um exemplo de instalação silencionsa
!pip install pandas -q

# Importando a biblioteca

Para usar o pandas você precisa importa-la

In [4]:
import pandas as pd

# Criação de DataFrames

Verificamos anteriormente que a junção de linhas e colunas formam um DataFrames, que pode ser obtido importado-se de um arquivo no formato "csv".

![table_dataframe.svg.png]()

Porém esta não é a unica maneira de termos um DataFrames, podemos cria-lo manualmente de algumas maneiras, é o que veremos agora.

## Partindo de um dicionário de dados

Dicionário de dados são estruturas em Python constituidos de pares "chave" e "valor", podendo facilmente ser transformada em DataFrames.
Abaixo criamos um dicionário simples para nosso exemplo.

In [28]:
# Exemplo de dicionário
dados_Dic = {
    'nome' : ['Israel', 'Ana Paula', 'Guilherme', 'Caroline', 'João Paulo', 'José Antonio'],
    'idade' : [54, 38, 16, 16, 2, 2],
    'cidade': ['Barretos', 'Salvador', 'São Paulo', 'São Paulo', 'Salvador', 'Salvador'],
    'comprou': [True, True, True, True, False, False]
}

In [29]:
# Verificando o tipo de dados
type(dados_Dic)

dict

In [30]:
# Criando o DataFrame
df_Dic = pd.DataFrame(dados_Dic)

In [31]:
df_Dic

           nome  idade     cidade  comprou
0        Israel     54   Barretos     True
1     Ana Paula     38   Salvador     True
2     Guilherme     16  São Paulo     True
3      Caroline     16  São Paulo     True
4    João Paulo      2   Salvador    False
5  José Antonio      2   Salvador    False

In [32]:
# Criando um identificador único para o DataFrame, ou indice
id_usuario =['IS54','AP38','GU16','CA16','JP2','JA2']

In [33]:
# Associando o identificador único criado ao DataFrame
df_Dic.index = id_usuario

In [34]:
# Após associação
df_Dic

              nome  idade     cidade  comprou
IS54        Israel     54   Barretos     True
AP38     Ana Paula     38   Salvador     True
GU16     Guilherme     16  São Paulo     True
CA16      Caroline     16  São Paulo     True
JP2     João Paulo      2   Salvador    False
JA2   José Antonio      2   Salvador    False

# Criando Indice
Como explicado acima, basta utilizar o 

```
# df.index = chave_criada
```
para associar o indice ao DataFrame

In [35]:
# selecionar pelo index
df_Dic.loc['AP38']

nome       Ana Paula
idade             38
cidade      Salvador
comprou         True
Name: AP38, dtype: object

## Partindo de listas

As listas são outra tipo de estrutura muito utilizado em Python e também facilmente utilizadas para criação de DataFrames, vejamos abaixo os mesmos passos utilizados acima, porém com esta outra estrutura:

In [36]:
# Exemplo de dicionário
dados_Lis = [['Israel', 54, 'Barretos', True],
         ['Ana Paulo', 38, 'Salvador', True],
         ['Guilherme', 16, 'São Paulo', True],
         ['Caroline', 54, 'São Paulo', True],
         ['João Paulo', 2, 'Salvador', False],
         ['José Antonio', 2, 'Salvador', False]
]

In [37]:
# Verificando o tipo de dados
type(dados_Lis)

list

In [38]:
# Criando o DataFrame
df_Lis = pd.DataFrame(dados_Lis)

In [39]:
df_Lis

              0   1          2      3
0        Israel  54   Barretos   True
1     Ana Paulo  38   Salvador   True
2     Guilherme  16  São Paulo   True
3      Caroline  54  São Paulo   True
4    João Paulo   2   Salvador  False
5  José Antonio   2   Salvador  False

# Diferenças entre Dicionários e Lista no uso de DataFrame
Neste caso observamos que a linha superior das colunas não possuem nomes, apenas uma sequencia númerica (0,1,2,3 etc).
Para que possamos deixar no mesmo padrão do anterior faremos alguns ajustes:

In [40]:
# Criando já com os nomes das colunas no DataFrame e indice
# criar DataFrame
id_usuario =['IS54','AP38','GU16','CA16','JP2','JA2']
df_Lis = pd.DataFrame(dados_Lis, columns=['nome', 'idade', 'cidade', 'comprou'],
                  index=id_usuario)

In [41]:
# Criando um identificador único para o DataFrame, ou indice
df_Lis

              nome  idade     cidade  comprou
IS54        Israel     54   Barretos     True
AP38     Ana Paulo     38   Salvador     True
GU16     Guilherme     16  São Paulo     True
CA16      Caroline     54  São Paulo     True
JP2     João Paulo      2   Salvador    False
JA2   José Antonio      2   Salvador    False

In [42]:
# selecionar pelo index
df_Lis.loc['IS54']

nome         Israel
idade            54
cidade     Barretos
comprou        True
Name: IS54, dtype: object

# Criando novas colunas
Independente da maneira como foi criado podemos adicionar colunas novas ao DataFrame com a funcionalidade chamada *broadcasting*.
Basta informar o nome da nova coluna e declarar um valor.

In [43]:
# Criar coluna "saldo"
df_Dic['saldo'] = 0.0

# Apresentar o DataFrame
df_Dic

              nome  idade     cidade  comprou  saldo
IS54        Israel     54   Barretos     True    0.0
AP38     Ana Paula     38   Salvador     True    0.0
GU16     Guilherme     16  São Paulo     True    0.0
CA16      Caroline     16  São Paulo     True    0.0
JP2     João Paulo      2   Salvador    False    0.0
JA2   José Antonio      2   Salvador    False    0.0

In [44]:
# Criar coluna "saldo"
df_Lis['saldo'] = 0.0

# Apresentar o DataFrame
df_Lis

              nome  idade     cidade  comprou  saldo
IS54        Israel     54   Barretos     True    0.0
AP38     Ana Paulo     38   Salvador     True    0.0
GU16     Guilherme     16  São Paulo     True    0.0
CA16      Caroline     54  São Paulo     True    0.0
JP2     João Paulo      2   Salvador    False    0.0
JA2   José Antonio      2   Salvador    False    0.0

# Modificanod o Index e colunas

Caso seja necessário, alterar o nome dos indices, ou o label das colunas, podemos realizar esta tarefa de forma simples

In [46]:
#Verificando o index existente
df_Dic.index

Index(['IS54', 'AP38', 'GU16', 'CA16', 'JP2', 'JA2'], dtype='object')

In [47]:
#Alterando o index
df_Dic.index =['54IS','38AP','16GUI','16CA','2JP','2JA']
df_Dic

               nome  idade     cidade  comprou  saldo
54IS         Israel     54   Barretos     True    0.0
38AP      Ana Paula     38   Salvador     True    0.0
16GUI     Guilherme     16  São Paulo     True    0.0
16CA       Caroline     16  São Paulo     True    0.0
2JP      João Paulo      2   Salvador    False    0.0
2JA    José Antonio      2   Salvador    False    0.0

In [50]:
# Alterando nome das colunas
colunas = ['Nome Familia', 'Idade','Naturalidade','Fez compras?','Saldo na loja']
df_Lis.columns = colunas
df_Lis

      Nome Familia  Idade Naturalidade  Fez compras?  Saldo na loja
IS54        Israel     54     Barretos          True            0.0
AP38     Ana Paulo     38     Salvador          True            0.0
GU16     Guilherme     16    São Paulo          True            0.0
CA16      Caroline     54    São Paulo          True            0.0
JP2     João Paulo      2     Salvador         False            0.0
JA2   José Antonio      2     Salvador         False            0.0